[
  {
    "tag": "BEATS Request System",
    "company": "Ticketmaster Mexico",
    "period": "2023-2024",
    "context": "Lack of visibility into BI requests and no SLA tracking. Manual processes caused delays and stakeholder dissatisfaction.",
    "actions": [
      "Designed and deployed BEATS (Bitácora de Ejecución y Administración de Tableros y Solicitudes) using Smartsheet.",
      "Built triage system with 3 intake forms (DB, BI, Marketing).",
      "Automated email responses, deadline reminders, and delivery confirmations with attachments."
    ],
    "impact": [
      "Reporting effectiveness improved from 80% to 98%.",
      "Average delivery time reduced by ~3 days.",
      "Stakeholder satisfaction increased significantly."
    ],
    "tools": ["Smartsheet", "Automation"],
    "softskills": ["Stakeholder management", "Process design", "Cross-team coordination", "Data Project Management"],
    "keywords": ["request system", "automation", "SLA tracking", "business intelligence", "Data Project Management"]
  },
  {
    "tag": "Tableau Executive Dashboards",
    "company": "Ticketmaster Mexico",
    "period": "2022-2025",
    "context": "Executives required clear visibility of revenue, sales, and fans' insights.",
    "actions": [
      "Designed Tableau and Looker Studio dashboards connected to BigQuery and Databricks.",
      "Integrated daily refresh processes with automated ETL pipelines.",
      "Aligned dashboards to exec and non-technical audiences."
    ],
    "impact": [
      "Daily update time reduced by 90%.",
      "Data accuracy improved to ~92%.",
      "Increased adoption by senior leadership for decision-making."
    ],
    "tools": ["Tableau", "Looker Studio", "BigQuery", "Databricks", "SQL", "Python"],
    "softskills": ["Storytelling", "Stakeholder communication", "Data visualization"],
    "keywords": ["dashboard", "Tableau", "revenue", "KPI"]
  },
{
  "tag": "Archtics Pipeline",
  "company": "Ticketmaster Mexico",
  "period": "2025",
  "context": "Tasked with migrating historical sales and customer data from Archtics (SQL Anywhere) to BigQuery for analytics purposes. With a limited two-month timeline before relocating to Canada, I adopted an AGILE methodology to ensure delivery of a functional MVP (minimum viable product) while laying the groundwork for full automation. The project required navigating corporate dependencies such as the global migration of Archtics databases to Databricks and the future enablement of API-based data access.",
  "actions": [
    "Designed and implemented a semi-automated ETL pipeline: exported CSVs from Archtics, stored them in Box, and loaded them into BigQuery via Databricks notebooks written in Python.",
    "Replaced manual legacy workflows with a governed, auditable process documented for reproducibility and scalability.",
    "Applied Agile principles (sprints, backlog prioritization, retrospectives) to deliver an MVP within the short timeframe and define clear next-phase iterations for automation.",
    "Aligned the project with global BI architecture standards and collaborated cross-functionally with the corporate data engineering team to ensure long-term integration feasibility."
  ],
  "impact": [
    "Enabled unified historical data analysis (2024–2025) within BigQuery, improving accessibility and consistency for BI, marketing, and finance teams.",
    "Delivered a sustainable data foundation for future automation phases, reducing manual effort and technical debt.",
    "Set a precedent for Agile-driven data migration under high-constraint scenarios, accelerating delivery without compromising quality or governance."
  ],
  "tools": ["Databricks", "Python", "Pandas", "BigQuery", "Box"],
  "softskills": [
    "AGILE project management",
    "Strategic planning under time constraints",
    "Cross-functional collaboration",
    "Problem-solving",
    "Process documentation and optimization"
  ],
  "keywords": [
    "ETL",
    "Agile",
    "Archtics",
    "BigQuery",
    "Databricks",
    "Data migration",
    "Automation roadmap"
  ]
},
  {
    "tag": "Global Databricks Proposal",
    "company": "Ticketmaster Global BI",
    "period": "2025",
    "context": "Global BI team required unified governance for Archtics data across regions.",
    "actions": [
      "Prepared proposal using Mexico case studies (Finance, Fraud, Banking/Sponsorships, Marketing, Reporting).",
      "Highlighted issues with current pipelines and benefits of a global approach.",
      "Suggested governance standards and best practices."
    ],
    "impact": [
      "Raised visibility of Mexico’s BI challenges at the global level.",
      "Contributed to alignment on future global architecture."
    ],
    "tools": ["Arcxhtcis", "Databricks", "BigQuery", "Python", "Governance frameworks"],
    "softskills": ["Strategic communication", "Governance", "Interarea Collaboration"],
    "keywords": ["Databricks", "governance", "global BI"]
  },
{
  "tag": "Fraud & Cybersecurity Data Protocol",
  "company": "Ticketmaster Mexico",
  "period": "2025",
  "context": "In response to several cybersecurity incidents affecting database integrity across on-premise and cloud environments, I led the creation of a preventive and reactive data protocol. Combining my background in Strategic Foresight with BI practices, I applied scenario planning and risk modelling to develop an immediate response plan for data breaches, fraud attempts, and potential data loss. The initiative aimed to strengthen resilience, governance, and detection capacity across all data platforms.",
  "actions": [
    "Developed a Data Accuracy dashboard to automatically detect anomalies, deletions, or alterations in key databases, integrating audit logs and backup status from Databricks and SQL servers.",
    "Built real-time monitoring dashboards for fraud detection and cybersecurity risks, ensuring visibility into suspicious transactions and data integrity issues.",
    "Collaborated with the Fraud, Cybersecurity, and Database teams to define KPIs, incident thresholds, and automated alert mechanisms.",
    "Created a structured data breach response protocol, outlining preventive, reactive, and post-incident recovery measures with cross-departmental coordination.",
    "Applied Strategic Foresight and scenario planning methods to anticipate possible cyberattack patterns and define mitigation strategies."
  ],
  "impact": [
    "Established a company-wide framework for rapid fraud and cyber incident response, improving reaction times and coordination.",
    "Enhanced data reliability and trust by implementing automated validation and backup alert systems.",
    "Reduced operational risk and data exposure across both on-premise and cloud infrastructures.",
    "Integrated long-term foresight principles into cybersecurity decision-making, fostering a proactive data governance culture."
  ],
  "tools": ["Tableau", "SQL", "Databricks", "Smartsheet", "Python"],
  "softskills": [
    "Strategic foresight and scenario planning",
    "Cross-functional collaboration",
    "Crisis management and decision-making",
    "Governance and risk mitigation",
    "Communication under pressure"
  ],
  "keywords": [
    "fraud detection",
    "cybersecurity",
    "data accuracy",
    "data breach protocol",
    "risk management",
    "scenario planning",
    "resilience"
  ]
},
  {
    "tag": "Cross-Functional Leadership",
    "company": "Ticketmaster Mexico",
    "period": "2022-2025",
    "context": "Multiple departments (MKT, Revenue, Finance, Ops, HR) required coordinated BI support.",
    "actions": [
      "Led BI team in handling requests across 7+ functional areas.",
      "Implemented triage to prioritize based on business value.",
      "Built collaboration frameworks with non-technical teams."
    ],
    "impact": [
      "Improved cross-functional project delivery.",
      "Greater alignment between BI outputs and business needs."
    ],
    "tools": ["Smartsheet", "Tableau", "SQL"],
    "softskills": ["Leadership", "Stakeholder management", "Collaboration"],
    "keywords": ["cross-functional", "leadership", "team coordination"]
  },
  {
    "tag": "Python Automation & Forecasting",
    "company": "Ticketmaster Mexico",
    "period": "2022-2024",
    "context": "Needed to automate ETL and forecasting processes.",
    "actions": [
      "Developed Databricks notebooks using PySpark and Pandas.",
      "Implemented forecasting models (Prophet, ARIMA) for sales projections.",
      "Built scripts for API consumption and QA checks."
    ],
    "impact": [
      "Stable pipelines reduced manual work.",
      "Enabled proactive sales and pricing decisions."
    ],
    "tools": ["Python", "Databricks", "Prophet", "ARIMA", "Pandas"],
    "softskills": ["Analytical thinking", "Problem-solving"],
    "keywords": ["ETL", "forecasting", "Prophet", "ARIMA", "automation"]
  },
  {
    "tag": "API Creation & Governance",
    "company": "Ticketmaster Mexico",
    "period": "2023",
    "context": "Manual exports slowed down analytics. Needed APIs for marketing and event data.",
    "actions": [
      "Created lightweight ingestion endpoints.",
      "Defined schema governance and documentation."
    ],
    "impact": [
      "Lower dependency on manual exports.",
      "Improved reproducibility of analytics."
    ],
    "tools": ["APIs", "Python", "Documentation"],
    "softskills": ["Technical leadership", "Documentation"],
    "keywords": ["API", "schema governance", "automation"]
  },
  {
    "tag": "Team Leadership & Migration",
    "company": "Ticketmaster Mexico",
    "period": "2022-2024",
    "context": "Led BI + DB team during cloud migration and restructuring.",
    "actions": [
      "Defined ETL/SQL standards and coached team members.",
      "Conducted code reviews and dashboard UX feedback.",
      "Added DB specialist to strengthen migration project."
    ],
    "impact": [
      "Improved delivery speed and data reliability.",
      "Team developed stronger technical and collaborative skills."
    ],
    "tools": ["Databricks", "SQL", "Tableau"],
    "softskills": ["Leadership", "Coaching", "Mentoring"],
    "keywords": ["leadership", "migration", "coaching"]
  },
  {
    "tag": "Forecasting & Pricing Committees",
    "company": "Ticketmaster Mexico",
    "period": "2025",
    "context": "Created data analysis committees for different business areas.",
    "actions": [
      "Established ‘Ticketnometría’ (pricing & sales).",
      "Formed Marketnometría (marketing data) and Deportenometría (sports data).",
      "Launched HPT initiative (high performance training)."
    ],
    "impact": [
      "Strengthened collaboration between BI and business units.",
      "Provided specialized insights for pricing and marketing strategies."
    ],
    "tools": ["Analytics", "SQL", "Python", "Tableau"],
    "softskills": ["Collaboration", "Strategic thinking"],
    "keywords": ["committee", "pricing", "forecasting", "collaboration"]
  },
  {
    "tag": "Strategic Foresight Research",
    "company": "Tec de Monterrey",
    "period": "2022-2025",
    "context": "Thesis on higher education in Costa Rica 2050 using horizon scanning.",
    "actions": [
      "Conducted literature review and horizon scanning using PESTLE.",
      "Analyzed accessibility and pressures on public universities.",
      "Produced recommendations for policymakers."
    ],
    "impact": [
      "Developed foresight methodology applicable to higher education.",
      "Identified key trends for Costa Rica’s education system."
    ],
    "tools": ["Strategic Foresight", "PESTLE Analysis", "Research"],
    "softskills": ["Analytical thinking", "Research", "Foresight"],
    "keywords": ["foresight", "education", "PESTLE", "Costa Rica"]
  },
  {
    "tag": "MBAI Program",
    "company": "Ontario Tech University",
    "period": "2025-2026",
    "context": "Master of Business Analytics & AI with 16-month structure.",
    "actions": [
      "Studied advanced courses in AI, ML, data strategy, and storytelling.",
      "Prepared for co-op/internship in Summer 2026."
    ],
    "impact": [
      "12 h/wk learning commitment.",
      "Strengthened portfolio with applied AI and analytics."
    ],
    "tools": ["Python", "SQL", "Tableau", "Machine Learning"],
    "softskills": ["Adaptability", "Continuous learning"],
    "keywords": ["MBAI", "Ontario Tech", "AI", "business analytics"]
  },
{
  "tag": "Wisevoter Interactive Maps",
  "company": "Top Agency",
  "period": "2021-2022",
  "context": "Worked on client-facing projects at Top Agency, including Wisevoter initiative to create interactive maps for political and social data.",
  "actions": [
    "Developed interactive maps using JavaScript and web libraries (D3.js / Leaflet).",
    "Transformed large datasets into accessible, comparative visualizations.",
    "Ensured responsiveness and usability across devices for public audiences."
  ],
  "impact": [
    "Enabled Wisevoter users to explore data interactively instead of static charts.",
    "Improved engagement with political and demographic data through visualization."
  ],
  "tools": ["JavaScript", "D3.js", "Leaflet", "Web Development"],
  "softskills": ["Creativity", "Client communication", "Visualization"],
  "keywords": ["maps", "Wisevoter", "Top Agency", "JavaScript", "data storytelling"]
},
{
  "tag": "Consulting Projects",
  "company": "Cuadrante Consultores",
  "period": "2019-2021",
  "context": "Provided consulting services in strategic foresight and economic analysis for clients in government and education sectors.",
  "actions": [
    "Conducted research and data analysis to support public policy decisions.",
    "Applied foresight methodologies (PESTLE, scenarios) to long-term planning.",
    "Delivered insights and reports tailored to institutional needs."
  ],
  "impact": [
    "Strengthened decision-making capacity of clients through structured foresight.",
    "Produced reports that guided strategic planning in higher education and government contexts."
  ],
  "tools": ["Foresight frameworks", "Economic analysis", "Scenario planning"],
  "softskills": ["Analytical thinking", "Client advisory", "Strategic foresight"],
  "keywords": ["consulting", "Cuadrante", "foresight", "economic analysis", "strategy"]
},
{
  "tag": "OCESA Brain Project",
  "company": "OCESA / Ticketmaster",
  "period": "2023",
  "context": "Collaborated on OCESA Brain initiative for data-driven event insights.",
  "actions": [
    "Supported integration of ticketing and event data pipelines.",
    "Worked on analytics to enhance promoter and event decision-making."
  ],
  "impact": [
    "Contributed to centralization of event intelligence for OCESA.",
    "Enhanced visibility of event performance metrics."
  ],
  "tools": ["Databricks", "SQL", "Analytics"],
  "softskills": ["Collaboration", "Problem-solving"],
  "keywords": ["OCESA Brain", "events", "analytics", "ticketing"]
},
{
  "tag": "MX-Data Project",
  "company": "Ticketmaster Mexico",
  "period": "2025",
  "context": "Developed as an agile alternative to the Azure migration project, MX-Data aimed to centralize and optimize data processing between Databricks and BigQuery. The project was conceived to reduce external dependencies, lower costs, and increase operational autonomy for morning load processes, focusing on speed, stability, and scalability of BI operations.",
  "actions": [
    "Mapped and prioritized critical databases for migration, defining triage criteria such as sensitivity, dependency level, and business priority.",
    "Created new data ingestion workflows in Databricks with automated cleaning and transformation scripts written in Python and SQL.",
    "Established a unified reporting model to serve BI, finance, and marketing teams using BigQuery as the single source of truth.",
    "Collaborated with PMO and development teams to align MX-Data with corporate architecture and compliance requirements."
  ],
  "impact": [
    "Reduced processing time and dependency on external vendors for morning loads.",
    "Improved data reliability and system scalability while simplifying maintenance.",
    "Provided a leaner and more autonomous architecture aligned with corporate standards."
  ],
  "tools": ["Databricks", "Python", "SQL", "BigQuery"],
  "softskills": [
    "Agile project leadership",
    "Strategic planning",
    "Cross-department collaboration",
    "System optimization"
  ],
  "keywords": ["data migration", "Databricks", "BigQuery", "BI architecture", "process efficiency"]
},
{
  "tag": "Dashboard Governance Program",
  "company": "Ticketmaster Mexico",
  "period": "2024–2025",
  "context": "To address inconsistencies in reporting and visual standards across departments, I designed a governance program for dashboard creation, documentation, and approval. The initiative aimed to ensure alignment with corporate KPIs, improve data quality, and accelerate delivery through standardized templates and QA processes.",
  "actions": [
    "Created standardized dashboard templates and documentation guidelines for BI, Finance, and Marketing teams.",
    "Defined a QA checklist covering data validation, visual consistency, and performance testing before publication.",
    "Established a centralized repository for dashboards, promoting transparency and reuse across teams.",
    "Trained analysts on storytelling best practices and stakeholder communication through data."
  ],
  "impact": [
    "Reduced dashboard rework by 40% and improved stakeholder satisfaction.",
    "Increased consistency, accuracy, and credibility of executive reporting.",
    "Fostered a data-driven culture with shared visual and analytical standards."
  ],
  "tools": ["Tableau", "Looker Studio", "Smartsheet", "BigQuery"],
  "softskills": [
    "Governance and standardization",
    "Training and mentoring",
    "Stakeholder management",
    "Analytical storytelling"
  ],
  "keywords": ["dashboard governance", "QA", "data quality", "standardization", "reporting framework"]
},
{
  "tag": "Leadership & Training Program",
  "company": "Ticketmaster Mexico",
  "period": "2024–2025",
  "context": "As BI Lead, I created a professional development program for analysts and coordinators focused on leadership, data management, and communication. The goal was to build future BI leaders capable of handling strategic projects, technical problem-solving, and cross-department collaboration.",
  "actions": [
    "Designed a structured learning path covering technical skills (SQL, Databricks, Tableau) and soft skills (leadership, communication, project ownership).",
    "Organized mentoring sessions and weekly knowledge-sharing meetings among analysts and team leads.",
    "Developed performance metrics and career progression plans aligned with corporate OKRs."
  ],
  "impact": [
    "Improved team effectiveness and engagement, achieving +20% OKR completion rate.",
    "Created a sustainable talent pipeline for future BI leadership roles.",
    "Enhanced collaboration and communication between BI and other departments."
  ],
  "tools": ["Smartsheet", "Databricks", "Tableau", "BigQuery"],
  "softskills": [
    "Leadership development",
    "Mentoring and coaching",
    "Performance management",
    "Team building"
  ],
  "keywords": ["leadership", "training program", "career development", "team performance"]
},
{
  "tag": "Recruitment Interview Training",
  "company": "Ticketmaster Mexico",
  "period": "2024–2025",
  "context": "Selected as part of the internal interviewer program to participate in recruitment processes for BI analysts. The objective was to strengthen hiring standards, technical assessments, and candidate evaluation alignment with company needs.",
  "actions": [
    "Trained in structured interview techniques and competency-based evaluation.",
    "Designed technical challenges focused on SQL, Excel, and BI logic for analyst candidates.",
    "Collaborated with HR to refine candidate selection criteria and improve onboarding efficiency."
  ],
  "impact": [
    "Improved accuracy and fairness in hiring BI professionals.",
    "Helped identify and onboard high-performing analysts who quickly integrated into team workflows."
  ],
  "tools": ["Excel", "SQL", "Smartsheet"],
  "softskills": ["Interviewing", "Evaluation", "Talent development"],
  "keywords": ["recruitment", "interviewing", "BI analysts", "talent acquisition"]
},
{
  "tag": "HR Analytics Dashboard",
  "company": "Ticketmaster Mexico",
  "period": "2024",
  "context": "Developed an HR analytics dashboard integrating attendance, satisfaction, and training data to support human resources decision-making. The goal was to visualize workforce engagement and learning program effectiveness.",
  "actions": [
    "Collected and cleaned data from HR surveys, attendance records, and training sessions.",
    "Created Looker Studio dashboards showing participation, satisfaction trends, and training impact.",
    "Implemented KPIs to track performance improvement and identify training needs."
  ],
  "impact": [
    "Improved visibility into workforce engagement and development programs.",
    "Enabled HR to make data-driven decisions regarding training investment and employee well-being."
  ],
  "tools": ["Looker Studio", "Smartsheet", "Excel"],
  "softskills": ["Analytical storytelling", "Stakeholder communication", "HR analytics"],
  "keywords": ["HR analytics", "employee engagement", "training metrics", "dashboard"]
},
{
  "tag": "GA4 to BigQuery Migration",
  "company": "Ticketmaster Mexico",
  "period": "2024",
  "context": "Led the migration of Google Analytics 4 (GA4) data into BigQuery to enable unified and historical digital analytics. Focused on building dynamic SQL filtering to extract meaningful insights by date, campaign, and event type.",
  "actions": [
    "Developed SQL queries for dynamic filtering and segmentation of GA4 data by date, campaign, and device.",
    "Automated the data export and transformation pipeline from GA4 to BigQuery.",
    "Created visual dashboards for digital performance tracking and marketing attribution."
  ],
  "impact": [
    "Enabled cross-year analysis of digital campaigns, improving marketing ROI visibility.",
    "Reduced manual extraction effort by automating recurring GA4 queries and transformations."
  ],
  "tools": ["BigQuery", "SQL", "Tableau"],
  "softskills": ["Automation", "Digital analytics", "Process improvement"],
  "keywords": ["GA4", "BigQuery", "SQL automation", "digital marketing analytics"]
},
{
  "tag": "PAIR Bot – Professional AI Reporting Assistant",
  "company": "Personal Project",
  "period": "2025",
  "context": "Developed an interactive chatbot prototype designed to present professional experience, projects, and technical skills using a structured knowledge base (kb.json). The goal was to create a conversational portfolio tool adaptable to career fairs and online networking.",
  "actions": [
    "Designed and coded the chatbot interface in HTML, CSS, and JavaScript with dynamic animation and adaptive layout.",
    "Structured the underlying knowledge base to provide contextual and skill-based responses.",
    "Integrated branding elements for LinkedIn and GitHub presentation."
  ],
  "impact": [
    "Created a fully functional conversational portfolio showcasing data and BI expertise.",
    "Demonstrated applied skills in web development, UX/UI, and knowledge structuring."
  ],
  "tools": ["HTML", "CSS", "JavaScript", "JSON"],
  "softskills": ["Creativity", "Storytelling", "Technical presentation"],
  "keywords": ["chatbot", "portfolio", "UI design", "NLP", "personal branding"]
},
{
  "tag": "SEO Data Strategy – Wisevoter Project",
  "company": "Top Agency",
  "period": "2021–2023",
  "context": "Collaborated on the Wisevoter project focused on SEO-driven data strategies to increase organic traffic and audience engagement in U.S. political and social content platforms.",
  "actions": [
    "Defined and implemented keyword strategies based on data analysis and topic trends.",
    "Developed dynamic visual content (maps, tables, and charts) using JavaScript and D3.js.",
    "Managed MySQL databases and coordinated with developers and designers to ensure SEO optimization and data accuracy."
  ],
  "impact": [
    "Increased organic reach and content ranking through data-informed SEO decisions.",
    "Enhanced interactivity and visibility of data storytelling elements on the platform."
  ],
  "tools": ["JavaScript", "D3.js", "MySQL", "WordPress", "Figma"],
  "softskills": ["SEO strategy", "Collaboration", "Data visualization"],
  "keywords": ["SEO", "data storytelling", "web analytics", "visualization"]
},
{
  "tag": "Media Monitoring & Global Context Tracking",
  "company": "Cuadrante",
  "period": "2020–2021",
  "context": "Monitored real-time media coverage of political, energy, and transportation topics to assess public perception and media impact for high-profile clients.",
  "actions": [
    "Collected and analyzed media and social data to identify narrative trends and reputation risks.",
    "Created strategic dashboards and reports summarizing coverage metrics, tone, and media exposure.",
    "Collaborated with communication teams to translate data insights into actionable recommendations."
  ],
  "impact": [
    "Improved understanding of public sentiment and stakeholder communication outcomes.",
    "Supported data-driven communication and PR strategies across multiple industries."
  ],
  "tools": ["Excel", "Tableau", "Python"],
  "softskills": ["Media analysis", "Strategic communication", "Data storytelling"],
  "keywords": ["media monitoring", "public opinion", "communication analytics", "PR metrics"]
},
{
  "tag": "Extracurricular Activities",
  "company": "Personal / Community",
  "period": "Ongoing",
  "context": "Active participation in extracurricular learning and community initiatives.",
  "actions": [
    "Attended AI & Data Summits (e.g., Vector Institute AI Summit & Career Fair 2025).",
    "Engaged in networking events, peer learning, and academic clubs.",
    "Developed side projects in visualization, healthcare apps, and hackathon-style competitions."
  ],
  "impact": [
    "Built a strong professional network in Canada and Mexico.",
    "Expanded skillset beyond formal roles, demonstrating adaptability and curiosity."
  ],
  "tools": ["Networking", "Hackathons", "Side projects"],
  "softskills": ["Networking", "Adaptability", "Continuous learning"],
  "keywords": ["extracurricular", "AI Summit", "networking", "projects"]
}
]


